"""
Conditional Statements - Lab
Проверка: https://judge.softuni.bg/Contests/Practice/Index/1012#0

03. Even or Odd

Условие:
Да се напише програма, която чете цяло число, въведено от потребителя и отпечатва на конзолата
дали числото е четно или нечетно.

1.	Първо създайде Python файл с подходящо име в съществуващия проект;
2.	Прочетете eдно цяло число от конзолата:
3.	Проверете дали числото е четно, като го разделите модулно на 2 и проверите дали има остатък от делението.
Ако няма остатък, отпечатайте изход "even". В противен случай отпечатайте "odd":
"""

number = int(input())

if number % 2 == 0:
    print("even")
else:
    print("odd")
