"""
Simple Operations and Calculations - Lab
07. Pet Shop
Проверка: https://judge.softuni.bg/Contests/Compete/Index/1011#2
Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета.
Храната се пазарува основно за кучета, от зоомагазин, но понякога стопанинът им купува и за животните на съседа му.
Една опаковка храна за кучета е на цена 2.50лв., а всяка останала, която не е за тях струва 4лв.
Вход:
От конзолата се четат 2 реда:
1.	Броят на кучетата - цяло число;
2.	Броят на останалите животни  - цяло число.
Изход:
На конзолата се отпечатва:
"{крайната сума} lv."
Резултатът трябва да бъде форматиран до втората цифра след десетичния знак.
"""

dogs = int(input())
other_animals = int(input())

total = (dogs * 2.50) + (other_animals * 4)
print(f"{total:.2f} lv.")
