"""
Simple Operations and Calculations - Lab
08. Yard Greening
Проверка: https://judge.softuni.bg/Contests/Compete/Index/1011#2
Божидара разполага с няколко къщи на Черноморието и желае да озелени дворовете на някои от тях, като по този начин
 създаде уютна обстановка и комфорт на гостите си, като за целта е наела фирма.
Напишете програма, която изчислява необходимите средства, които Божидара ще трябва да заплати на фирмата изпълнител
на проекта. Цената на един кв. м. е 7.61лв със ДДС. Тъй като нейният двор е доста голям, фирмата изпълнител предлага
18% отстъпка от крайната цена.
Вход
От конзолата се прочита само един ред:
1.	Кв. метри, които ще бъдат озеленени – реално число.
Изход
На конзолата се отпечатват два реда:
"The final price is: {крайна цена на услугата} lv."
"The discount is: {отстъпка} lv."
И двете суми трябва да бъдат форматирани до втората цифра след десетичния знак.
"""

square_meters = float(input())

total = square_meters * 7.61
discount = total * 0.18
total = total - discount

print(f"The final price is: {total:.2f} lv.")
print(f"The discount is: {discount:.2f} lv.")
