"""
Simple Operations and Calculations - Exercise
Проверка: https://judge.softuni.bg/Contests/Compete/Index/1160#0

05. Dance Hall

Условие:
Група танцьори си търсят нова зала.  Залата, която са харесали, е правоъгълна и има размери:
L - дължина и W - ширина (в метри). В залата има квадратен гардероб със страна - A
и правоъгълна скамейка с площ 10 пъти по-малка от площта на залата.
Мястото, което заема един танцьор е 40 см² и допълнително за свободно движение му трябват  още  7000см².
Напишете програма, която да изчислява колко танцьори могат да се поберат в залата и да се движат свободно.
Полученият резултат трябва да се закръгли до най-близкото цяло число надолу.
Вход
От конзолата се четат 3 реда:
1.	L – дължина на залата в метри – реално число;
2.	W – ширина на залата в метри – реално число;
3.	А – страна на гардероба в метри – реално число.
Изход
Да се отпечата на конзолата едно цяло число – броя танцьори, които могат да се поберат в свободното пространство
на залата, закръглени до най-близкото цяло число надолу.
"""

import math

length = float(input())
width = float(input())
side = float(input())

area = (length * 100) * (width * 100)
wardrobe = (side * 100) * (side * 100)
bench = area / 10
free_space = area - wardrobe - bench
dancers = free_space / (40 + 7000)

print(f'{math.floor(dancers)}')

