"""
Simple Operations and Calculations - Exercise
Проверка: https://judge.softuni.bg/Contests/Compete/Index/1160#0

04. Tailoring Workshop

Условие:
Шивашки цех приема поръчки за ушиване на покривки и карета за маси за заведения. Покривките са правоъгълни,
каретата са квадратни, броят им винаги е еднакъв. Покривката трябва да виси с 30 см от всеки ръб на масата.
Страната на каретата е половината от дължината на масите.
Във всяка поръчка се включва информация за броя и размерите на масите.
Напишете програма, която пресмята цената на поръчка в долари и в левове,
като квадратен метър плат за правоъгълна покривка струва 7 долара, а за каре – 9 долара. Курсът на долара е 1.85 лева.
Вход
Потребителят въвежда 3 числа, по едно на ред:
Брой правоъгълни маси – цяло число;
Дължина на правоъгълните маси в метри – реално число;
Широчина на правоъгълните маси в метри – реално число.
Изход
Да се отпечатат на конзолата две числа: цената на изделията в долари и в левове:
o	"{цена в долари} USD"
o	"{цена в левове} BGN"
Резултатите да се форматират до два знака след  десетичната запетая.
"""

tables = int(input())
l_tables = float(input())
w_tables = float(input())

area_rectangular = tables * ((l_tables + (2 * 0.30)) * (w_tables + (2 * 0.30)))
area_square = tables * ((l_tables / 2) * (l_tables / 2))

usd = (area_rectangular * 7) + (area_square * 9)
bgn = usd * 1.85

print(f"{usd:.2f} USD")
print(f"{bgn:.2f} BGN")

