/*
Изпит по "Основи на програмирането" - 20 и 21 Април 2019 
Задача 1. Великденска пекарна
Великденските празници наближават и местната пекарна започва да набавя продуктите, 
които ще са ѝ нужни за изработка на великденските сладкиши. 
Вашата задача е да напишете програма, която да изчислява нужната сума за закупуване на продуктите. 
Нужните продукти са: брашно, захар, яйца и мая. 
От конзолата се въвежда цената на брашното за килограм, нужните килограми брашно, 
килограмите захар, броя на корите с яйца и пакетите мая.
•	цената на килограм захар е с 25% по-ниска от тази на килограм брашно
•	цената на една кора с яйца е с 10% по-висока от цената на килограм брашно
•	цената на един пакет мая е с 80% по-ниска от цената на килограм захар
Вход
От конзолата се четат 5 реда:
1.	Цена на брашното за един килограм – реално число в интервала [0.00 … 10000.00]
2.	Килограми на брашното – реално число в интервала [0.00 … 10000.00]
3.	Килограми на захарта – реално число в интервала [0.00 … 10000.00]
4.	Брой кори с яйца – цяло число в интервала [0 … 10000]
5.	Пакети мая  – цяло число в интервала [0 … 10000]
Изход
Да се отпечата на конзолата едно число:
•	Сумата, която ще им е необходима, форматирана до втория знак след десетичната запетая
Примерен вход и изход:
Вход	Изход	Обяснения
50      968.75  Цена на захарта за килограм: 50 * 0.75 = 37.5 лв.
10              Цена на яйцата за кора: 50 * 1.1 = 55 лв.
3.5             Цена на маята за пакет: 37.5 * 0.2 = 7.5 лв.
6               Сума за брашното: 50 * 10 = 500 лв.
1		        Сума за захарта: 37.5 * 3.5 = 131.25 лв.
                Сума за яйцата: 55 * 6 = 330 лв.
                Сума за маята: 7.5 * 1 = 7.5 лв.
                Обща сума: 500 + 131.25 + 330 + 7.5 = 968.75 лв.

Вход	    Изход	
63.44       1105.92	
3.57
6.35
8
2
*/
function easterBakery(input) {
    let flourPricePerKg = Number(input.shift());    
    let flourKilograms = Number(input.shift());    
    let sugarKilograms = Number(input.shift());    
    let countEggsPacks = Number(input.shift());    
    let yeastPacks = Number(input.shift());

    let flourTotal = flourPricePerKg * flourKilograms;
    let sugarTotal = (flourPricePerKg * 0.75) * sugarKilograms;
    let eggsTotal = (flourPricePerKg * 1.1) * countEggsPacks;
    let yeastTotal = ((flourPricePerKg * 0.75) * 0.2) * yeastPacks;

    console.log((flourTotal + sugarTotal + eggsTotal + yeastTotal).toFixed(2));
}

easterBakery(['50', '10', '3.5', '6', '1']);  // Expected Output: 968.75
easterBakery(['63.44', '3.57', '6.35', '8', '2']);  // Expected Output: 1105.92
