/*
Задача 1. Великденски обяд
Бабата на Деси всяка година приготвя обяд за семейството си за Великден. 
Напишете програма, която изчислява какви разходи ще има по приготвянето на обяда, 
като знаете колко броя козунаци, кори с яйца и килограма курабии е купила.  
Цените на продуктите са следните:
•	Козунак  – 3.20 лв.
•	Яйца –  4.35 лв. за кора с 12 яйца
•	Курабии – 5.40 лв. за килограм
•	Боя за яйца - 0.15 лв. за яйце
Вход
От конзолата се четат 3 реда:
•	Брой козунаци - цяло число в интервала [0 … 99]
•	Брой кори с яйца - цяло число в интервала [0 … 99]
•	Килограми курабии - цяло число в интервала [0 … 99]
Изход
Да се отпечата на конзолата колко ще са разходите по приготвянето на обяда. 
Сумата да бъде форматирана до втория знак след десетичната запетая.
Примерен вход и изход

Вход	Изход	Обяснения
3       38.10   Цена за козунаците: 3 броя * 3.20 = 9.60
2               Цена за яйца: 2 кори * 4.35 = 8.70
3	   	        Цена за курабии: 3 кг * 5.40 = 16.20
                Цена за боя за яйца: 2 кори * 12 яйца * 0.15 = 3.60	
                Обща цена за разходите по обяда: 9.60 + 8.70 + 16.20 + 3.60 = 38.10
                
|------------------|-----------------|
|Вход	Изход	   |Вход   Изход     |
|4       53.60     |2      35.65     |
|4                 |3                |
|3		           |2                |
|------------------|-----------------|
*/
function easterLunch(params) {
    countEasterBreads = Number(params.shift());
    countEggsPacks = Number(params.shift());
    kilogramCookies = Number(params.shift());

    let totalEasterBread = countEasterBreads * 3.20;
    let totalEggPacks = countEggsPacks * 4.35;
    let totalCookies = kilogramCookies * 5.40;
    let totalEggPaint = countEggsPacks * 12 * 0.15;

    console.log((totalEasterBread + totalEggPacks + totalCookies + totalEggPaint).toFixed(2));
}

easterLunch(['3', '2', '3']);  // Expexted Output: 38.10
easterLunch(['4', '4', '3']);  // Expexted Output: 53.60
easterLunch(['2', '3', '2']);  // Expexted Output: 35.65
