"""
Simple Operations and Calculations - More Exercises
Проверка: https://judge.softuni.bg/Contests/Practice/Index/1642#0

06. Fishland

Условие:
Георги ще има гости вечерта и решава да ги нагости с паламуд, сафрид и миди. Затова отива на рибната борса,
за да си купи по няколко килограма. Oт конзолата се въвеждат цените в лева на скумрията и цацата.
Също количеството на паламуд, сафрид и миди в килограми. Колко пари ще са му необходими, за да плати сметката си,
ако цените на борсата са:
Паламуд – 60% по-скъп от скумрията
Сафрид – 80% по-скъп от цацата
Миди – 7.50 лв. за килограм
Вход
От конзолата се четат 5 числа:
Първи ред – цена на скумрията на килограм. Реално число в интервала [0.00…40.00]
Втори ред – цена на цацата на килограм. Реално число в интервала [0.00…30.00]
Трети ред – килограма паламуд. Реално число в интервала [0.00…50.00]
Четвърти ред – килограма сафрид. Реално число в интервала [0.00… 70.00]
Пети ред – килограма миди. Цяло число в интервала [0 ... 100]
Изход
Да се отпечата на конзолата едно число с плаваща запетая: колко пари ще са нужни на Георги, за да си плати сметката.
Закръглено до вторият знак след десетичната запетая (1.2457 -> 1.25).
"""

price_palamud_kg = float(input())
price_safrid_kg = float(input())
kg_palamud = float(input())
kg_safrid = float(input())
kg_midi = int(input())

palamud_for_1_kg = price_palamud_kg + (price_palamud_kg * 0.60)
palamud_total = palamud_for_1_kg * kg_palamud

safrid_for_1_kg = price_safrid_kg + (price_safrid_kg *0.80)
safrid_total = safrid_for_1_kg * kg_safrid

midi_total = kg_midi * 7.50

total = palamud_total + safrid_total + midi_total

print(f"{total:.2f}")