"""
Simple Operations and Calculations - More Exercises
Проверка: https://judge.softuni.bg/Contests/Practice/Index/1642#0

07. House Painting

Условие:
Напишете програма, която да пресмята колко литра боя е нужна за боядисването на къщa.
Като за стените се използва зелена боя, а за покрива – червена. Разхода на зелената боя е 1 литър за 3.4 м2,
а на червената – 1 литър за 4.3 м2.
Стените имат следните размери:
Предната и задната стена са квадрати със страна „x“
на предната стена има правоъгълна врата с широчина 1.2м и височина 2м
Страничните стени са правоъгълници със страни „x“ и „y“
и на двете странични стени има по един квадратен прозорец със страна 1.5м
Покривът има следните размери:
Два правоъгълника със страни „x“ и „y“
Два равностранни триъгълника със страна „x“ и височина „h“
Трябва да пресметнете площта на всички страни и площта на покрива, за да
намерите колко литра от всяка боя ще са нужни.
Вход
От конзолата се четат 3 реда:
1.	x – височината на къщата – реално число в интервала [2...100]
2.	y – дължината на страничната стена – реално число в интервала [2...100]
3.	h – височината на триъгълната стена на прокрива – реално число в интервала [2...100]
Изход
Да се отпечатат на конзолата две числа всяко на нов ред:
Литрите зелена боя
Литритe червена боя
Форматирани до вторият знак след десетичната запетая.
"""

x = float(input())
y = float(input())
h = float(input())

side_walls = (2 * (x * y)) - 4.50
front_and_back_walls = (2 * (x * x)) - 2.4
total_area_house = side_walls + front_and_back_walls
green_paint = total_area_house / 3.4
print(f"{green_paint:.2f}")

roof_sides = 2 * (x * y)
roof_front_and_back = 2 * (x * (h / 2))
total_roof_area = roof_sides + roof_front_and_back
red_paint = total_roof_area / 4.3
print(f"{red_paint:.2f}")



